Autodesk.Revit.DB.Events.DocumentSaveToCentralProgessChangedEventArgs.FailureDueToConflicts
Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgessChangedEventArgs.SaveToCentralFinished
Indicates if current 'save to central' is finished or not.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgessChangedEventArgs.RetryTimes
The number of times Revit has tried to Save to Central." Its value is '0' at the first time.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgessChangedEventArgs.#ctor(Autodesk.Revit.DB.Events.DocumentSaveToCentralProgessChangedEventArgs)
Creates a copy of the DocumentSaveToCentralProgessChangedEventArgs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgessChangedEventArgs
The event arguments used during the save to central phase of the WorksharedOperationProgressChanged event.
Remarks:
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
Since:
2017 Subscription Update